{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hello", "Hi", "Good morning", "Hey"],
      "responses": ["Hello! How can I assist you today?", "Hi there! How may I help you?", "Good morning! What can I do for you?"]
    },
    {
      "tag": "product_inquiry",
      "patterns": ["Tell me about iPhones", "iPhone models", "iPhone details"],
      "responses": ["We offer a range of iPhones, including the latest models like iPhone 13 and iPhone SE. Which specific model are you interested in?", "Explore our selection of iPhones, from iPhone 11 to iPhone 13. How can I help you choose the right one?"]
    },
    {
      "tag": "imac_inquiry",
      "patterns": ["Tell me about iMacs", "iMac models", "iMac specifications"],
      "responses": ["Discover our iMac lineup, including the powerful iMac Pro and the sleek iMac 24-inch. What features are you looking for in an iMac?", "Our iMacs come in various configurations and sizes. Do you have specific requirements for an iMac?"]
    },
    {
      "tag": "product_comparison",
      "patterns": ["Compare iPhones and iMacs", "iPhone vs. iMac", "Which is better, iPhone or iMac?"],
      "responses": ["iPhones and iMacs serve different purposes. iPhones are mobile devices, while iMacs are desktop computers. It depends on your needs. How can I assist you further?", "To compare iPhones and iMacs, we need to consider your usage and preferences. What aspects are most important to you?"]
    },
    {
      "tag": "pricing",
      "patterns": ["What are the prices of iPhones?", "iMac pricing", "Cost of Apple products"],
      "responses": ["iPhone prices vary depending on the model and storage capacity. Could you specify the iPhone model you're interested in?", "iMac pricing starts from $1,299. Prices may differ based on the configuration. Do you have a specific iMac model in mind?"]
    },
    {
      "tag": "order_status",
      "patterns": ["Check my order status", "Where is my iPhone?", "Track my iMac order"],
      "responses": ["To check your order status, please provide your order number, and I'll assist you with the details.", "Sure, I can help you track your order. May I have your order number, please?"]
    },
    {
      "tag": "accessories",
      "patterns": ["Tell me about Apple accessories", "Accessories for iPhone", "iMac peripherals"],
      "responses": ["We offer a variety of Apple accessories, including iPhone cases, AirPods, Magic Mouse, and more. Which accessory are you interested in?", "Explore our range of Apple accessories, from keyboard options for iMacs to cases for iPhones. How can I assist you with accessories?"]
    },
    {
      "tag": "payment_methods",
      "patterns": ["How can I make a payment?", "Payment options", "Accepted payment methods"],
      "responses": ["You can make a payment using credit cards, debit cards, and Apple Pay. Let me know if you have questions about the payment process.", "We accept major credit and debit cards, as well as Apple Pay, for a convenient and secure payment experience. Is there a specific payment method you'd like to know more about?"]
    },
    {
      "tag": "shipping_info",
      "patterns": ["Tell me about shipping", "Shipping options", "Delivery times"],
      "responses": ["We offer standard and express shipping. Delivery times depend on your location and the chosen shipping option. Can you provide your location for more accurate information?", "Our shipping options include standard and express delivery. For precise delivery times, please share your location or ZIP code."]
    },
    {
      "tag": "return_policy",
      "patterns": ["What is your return policy?", "Returns and exchanges", "Product refunds"],
      "responses": ["Our return policy allows returns within 30 days of purchase. Please visit our Returns and Refunds page for detailed instructions.", "We have a 30-day return policy for most products. If you'd like to initiate a return, let me know, and I'll guide you through the process."]
    },
    {
      "tag": "technical_support",
      "patterns": ["I need technical support", "iPhone troubleshooting", "iMac assistance"],
      "responses": ["For technical support, please contact our technical support team at [support email or phone number]. They can assist you with troubleshooting and technical issues.", "Our technical support team is here to help. You can reach them at [support email or phone number]. What technical issue are you facing?"]
    },
    {
      "tag": "payment_confirmation",
      "patterns": ["I've made a payment", "Payment confirmation", "Confirm my order payment"],
      "responses": ["Thank you for the payment! To confirm your order, please provide your order number, and I'll verify the payment for you.", "We appreciate your payment. To confirm your order, please share your order number, and I'll ensure everything is in order."]
    },
    {
      "tag": "order_customization",
      "patterns": ["Can I customize my iPhone or iMac order?", "Customization options", "Personalized products"],
      "responses": ["Yes, we offer customization options for some products. Please specify the product you'd like to customize, and I'll provide details on available options.", "Customizing your order is possible for certain products. Let me know which product you're interested in, and I'll guide you through the customization process."]
    },
    {
      "tag": "stock_availability",
      "patterns": ["Is the iPhone model X in stock?", "iMac availability", "Product availability"],
      "responses": ["I'll check the stock for the iPhone model X for you. Please wait a moment while I verify the availability.", "Let me check the availability of the iMac model you're interested in. It will just take a moment."]
    },
    {
      "tag": "promo_offers",
      "patterns": ["Tell me about current promotions", "Discounts and offers", "Special deals"],
      "responses": ["We have ongoing promotions and special offers on select products. Please visit our Promotions page for the latest discounts and deals.", "Explore our current promotions and discounts on our Promotions page. Is there a specific product you're interested in?"]
    },
    {
      "tag": "bye",
      "patterns": ["Goodbye", "Bye", "See you later", "Farewell"],
      "responses": ["Goodbye! If you have more questions in the future, feel free to ask.", "Bye! Have a great day!"]
    },
    {
      "tag": "ok",
      "patterns": ["Ok", "Alright", "Okay", "Got it"],
      "responses": ["Great! If you have any more questions, don't hesitate to ask.", "Alright! Let me know if you need any further assistance."]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "Appreciate it", "Grateful"],
      "responses": ["You're welcome! If you have any more questions, feel free to ask.", "You're welcome! I'm here to help."]
    },
    {
      "tag": "availability_notification",
      "patterns": ["Notify me when the iPhone 14 is in stock", "Availability alert", "Product restock notification"],
      "responses": ["Sure, we can notify you when the iPhone 14 becomes available. Please provide your email address, and we'll keep you updated.", "To receive availability notifications, please share your email, and we'll inform you as soon as the iPhone 14 is back in stock."]
    },
    {
      "tag": "shipping_confirmation",
      "patterns": ["I received a shipping confirmation email", "Confirm my order shipment", "Shipment details"],
      "responses": ["Great! Your order is on the way. To confirm the shipment, please provide your order number, and I'll check the status for you.", "I'm glad to hear that your order is on its way. To confirm the shipment, kindly share your order number, and I'll provide details."]
    },
    {
      "tag": "warranty_info",
      "patterns": ["Tell me about product warranties", "Warranty coverage", "Warranty terms"],
      "responses": ["Our products come with standard manufacturer warranties. Warranty duration varies by product. Please specify the product you're interested in for more details.", "Product warranties ensure your peace of mind. To learn about the warranty for a specific product, let me know which one you'd like to inquire about."]
    },
    {
      "tag": "bulk_ordering",
      "patterns": ["Can I place a bulk order?", "Bulk purchase inquiries", "Large order requirements"],
      "responses": ["We do offer options for bulk orders. To discuss bulk purchase details and pricing, please provide your contact information, and our sales team will get in touch with you.", "Bulk orders are possible. Please share your contact details, including your company name, and we'll assist you with bulk purchase inquiries."]
    },
    {
      "tag": "repair_services",
      "patterns": ["I need a product repair", "Product repair options", "Service center location"],
      "responses": ["If you require a product repair, please visit our nearest service center. You can find the service center location on our website or by providing your ZIP code.", "For product repairs, visit our service center. To locate the nearest service center, you can share your location or visit our website for details."]
    },
    {
      "tag": "delivery_issues",
      "patterns": ["I'm facing issues with my delivery", "Delivery problems", "Delayed shipment"],
      "responses": ["I apologize for the inconvenience. Please provide your order number, and I'll investigate the issue with your delivery and assist you in resolving it.", "I'm sorry to hear about the delivery problem. To help you, I need your order number to check the status and address any issues."]
    },
    {
      "tag": "product_recommendation",
      "patterns": ["Can you recommend an iPhone model?", "Suggest an iMac configuration", "Product suggestions"],
      "responses": ["Certainly! To recommend the right product, I'll need to know more about your preferences and usage. Are you looking for specific features or specifications in an iPhone?", "I'd be happy to recommend a suitable iPhone or iMac. Could you share more details about your requirements and budget?"]
    },
    {
      "tag": "payment_issues",
      "patterns": ["I'm having payment problems", "Payment error", "Card declined"],
      "responses": ["I'm here to help with payment issues. Please describe the problem you're facing, and I'll provide guidance on how to resolve it.", "Payment problems can be frustrating. To assist you, please provide details about the issue you encountered during the payment process."]
    },
    {
      "tag": "membership_program",
      "patterns": ["Tell me about your membership program", "Customer loyalty program", "Benefits of membership"],
      "responses": ["Our membership program offers exclusive benefits, such as early access to products, special discounts, and more. Would you like to join our membership program, or do you need more information about it?", "Joining our membership program unlocks various benefits. Do you want to enroll, or would you like to know more about the advantages of being a member?"]
    },
    {
      "tag": "order_tracking",
      "patterns": ["How can I track my order?", "Order status", "Track shipment"],
      "responses": ["To track your order, please provide your order number, and I'll check its current status for you.", "Tracking your order is easy. Just share your order number, and I'll assist you in finding out where your shipment is."]
    },
    {
      "tag": "return_policy",
      "patterns": ["Tell me about your return policy", "Product return process", "Refund policy"],
      "responses": ["Our return policy allows for returns within 30 days of purchase. For more details, please visit our 'Return Policy' page on our website.", "We have a customer-friendly return policy. To learn more about it, you can visit our website's 'Return Policy' section."]
    },
    {
      "tag": "product_comparison",
      "patterns": ["Compare iPhone models", "iPhone vs. iMac", "Product feature comparison"],
      "responses": ["Certainly! I can help you compare different iPhone models or Apple products. What specific features or aspects would you like to compare?", "Product comparisons can be useful. Please specify which iPhone models or Apple products you want to compare, and let me know the criteria you're interested in."]
    },
    {
      "tag": "accessories_info",
      "patterns": ["Tell me about Apple accessories", "Accessories for iPhones", "Accessory options"],
      "responses": ["We offer a variety of Apple accessories, including cases, chargers, and more. Please specify which accessory you're interested in, and I'll provide details.", "Accessories can enhance your Apple experience. Let me know which Apple accessory you want to learn more about."]
    },
    {
      "tag": "store_hours",
      "patterns": ["What are your store hours?", "Operating hours", "Shop opening times"],
      "responses": ["Our store hours vary by location. To find the hours of operation for a specific store, please provide the store's name or your ZIP code.", "Store hours depend on the location. Share the name of the store or your location, and I'll give you the opening and closing times."]
    },
    {
      "tag": "promotions",
      "patterns": ["Are there any ongoing promotions?", "Discounts and offers", "Current deals"],
      "responses": ["Yes, we regularly offer promotions and discounts. To learn about our current promotions, please visit our 'Promotions' page on our website.", "Staying updated on our promotions is a smart move. Check our website for the latest deals and discounts."]
    },
    {
      "tag": "technical_support",
      "patterns": ["I need technical support", "Tech help", "Product troubleshooting"],
      "responses": ["I'm here to assist with technical issues. Please describe the problem you're facing, and I'll provide guidance on troubleshooting.", "Technical support is essential. Let me know the technical problem you're encountering, and I'll help you find a solution."]
    },
    {
      "tag": "gift_wrapping",
      "patterns": ["Do you offer gift wrapping?", "Gift options", "Present wrapping service"],
      "responses": ["Yes, we provide gift wrapping services for your orders. To have your purchase gift-wrapped, please select the 'Gift Wrapping' option during checkout.", "Gift wrapping adds a personal touch. Choose the 'Gift Wrapping' option during checkout to have your order beautifully wrapped."]
    },
    {
      "tag": "order_cancellation",
      "patterns": ["Can I cancel my order?", "Order cancellation request", "Canceling an order"],
      "responses": ["You can cancel your order if it hasn't been shipped yet. Please provide your order number, and I'll assist you with the cancellation process.", "Order cancellations are possible before shipment. Share your order number, and I'll guide you through the cancellation steps."]
    },
    {
      "tag": "privacy_policy",
      "patterns": ["Tell me about your privacy policy", "Data protection", "Privacy terms"],
      "responses": ["We take data privacy seriously. To learn about our privacy policy and how we protect your information, please visit our 'Privacy Policy' page on our website.", "Your data security matters to us. Explore our website's 'Privacy Policy' section for detailed information."]
    },
    {
      "tag": "product_availability",
      "patterns": ["Is this product in stock?", "Product availability", "Stock status"],
      "responses": ["I can check the availability of a specific product for you. Please provide the product name or model, and I'll confirm its stock status.", "To check product availability, let me know the name or model of the product you're interested in."]
    },
    {
      "tag": "order_payment",
      "patterns": ["How can I make a payment?", "Payment methods", "Payment options"],
      "responses": ["We offer various payment methods, including credit cards, PayPal, and Apple Pay. During checkout, you can choose your preferred payment option.", "Making a payment is easy. At checkout, you can select from multiple payment methods for your convenience."]
    },
    {
      "tag": "shipping_info",
      "patterns": ["Tell me about your shipping process", "Delivery details", "Shipping time"],
      "responses": ["We provide fast and reliable shipping. Shipping times depend on your location and the chosen shipping method. To get an estimate, please share your ZIP code.", "Shipping is crucial for timely delivery. Let me know your ZIP code, and I'll estimate the shipping time for your area."]
    },
    {
      "tag": "product_recommendations",
      "patterns": ["Can you recommend a product?", "Product suggestions", "Best-selling items"],
      "responses": ["I'd be happy to recommend a product. Could you tell me your preferences or the type of product you're looking for? That way, I can provide tailored suggestions.", "To make a recommendation, please share your preferences or the category of products you're interested in."]
    },
    {
      "tag": "subscription_services",
      "patterns": ["Do you offer subscription services?", "Monthly subscriptions", "Subscribe for products"],
      "responses": ["Yes, we offer subscription services for select products. These subscriptions provide convenience and savings. Please specify which product you're interested in subscribing to.", "Subscriptions can simplify your shopping experience. Let me know which product you'd like to subscribe to."]
    },
    {
      "tag": "product_warranty",
      "patterns": ["Tell me about product warranties", "Warranty coverage", "Product guarantee"],
      "responses": ["Our products come with warranties that vary by product type. To learn about the warranty for a specific product, please provide the product name or model.", "Warranties ensure product satisfaction. Share the product name or model, and I'll provide warranty details."]
    },
    {
      "tag": "loyalty_program",
      "patterns": ["Do you have a loyalty program?", "Customer rewards", "Membership benefits"],
      "responses": ["Yes, we have a loyalty program that rewards our valued customers. To learn more about our loyalty program and its benefits, please visit our 'Loyalty Program' page on our website.", "Our loyalty program offers exclusive benefits. Discover more details on our website's 'Loyalty Program' page."]
    },
    {
      "tag": "order_modifications",
      "patterns": ["Can I modify my order?", "Change order details", "Edit shipment address"],
      "responses": ["You may be able to modify your order if it hasn't been processed yet. Please provide your order number, and I'll assist you with order modifications.", "Order modifications are possible under certain conditions. Share your order number, and I'll guide you through the process."]
    },
    {
      "tag": "customer_reviews",
      "patterns": ["Can I read customer reviews?", "Product ratings", "Customer feedback"],
      "responses": ["Certainly, you can find customer reviews and product ratings on our website's product pages. These reviews provide insights into the experiences of other customers.", "Customer reviews offer valuable insights. Browse our product pages to read reviews and see product ratings."]
    },
    {
      "tag": "product_customization",
      "patterns": ["Can I customize a product?", "Personalized products", "Product engraving"],
      "responses": ["Some of our products offer customization options, such as engraving. To inquire about customization for a specific product, please provide its name or model.", "Customization adds a personal touch. Let me know which product you're interested in customizing."]
    },
    {
      "tag": "product_comparison",
      "patterns": ["Compare two products", "Product contrast", "Which product is better?"],
      "responses": ["I can help you compare two products. Please provide the names or models of the products you'd like to compare, and I'll provide a detailed comparison.", "To compare two products, specify their names or models, and I'll outline the differences."]
    },
    {
      "tag": "return_policy",
      "patterns": ["What is your return policy?", "Product returns", "Return process"],
      "responses": ["Our return policy ensures customer satisfaction. To learn more about our return policy, please visit our 'Return Policy' page on our website.", "Understanding our return policy is important. Find detailed information on our website's 'Return Policy' page."]
    },
    {
      "tag": "gift_options",
      "patterns": ["Do you offer gift options?", "Gift wrapping", "Gift message"],
      "responses": ["Yes, we offer gift options, including gift wrapping and personalized gift messages. These options are available during the checkout process. If you have specific requests, please let me know.", "Gift options can make your purchase special. During checkout, you can choose gift wrapping and include a personalized message for your recipient."]
    },
    {
      "tag": "product_demonstration",
      "patterns": ["Can I see a product demonstration?", "Product video", "Demo video"],
      "responses": ["We provide product demonstration videos for select products. Please specify the product you'd like to see a demonstration of, and I'll guide you to the video.", "Product demos help you make informed decisions. Tell me the product name or model, and I'll direct you to the demo video."]
    },
    {
      "tag": "technical_support",
      "patterns": ["I need technical support", "Product troubleshooting", "Tech assistance"],
      "responses": ["If you require technical support, our technical team is here to help. Please share the issue or product you need assistance with, and I'll connect you to our technical support department.", "Technical support is available to resolve your issues. Describe your technical problem or specify the product, and I'll connect you with our experts."]
    },
    {
      "tag": "upcoming_products",
      "patterns": ["What are your upcoming products?", "New product releases", "Future launches"],
      "responses": ["We're excited about our upcoming product releases. Stay tuned for our announcements on our website's 'Upcoming Products' page, where we reveal the latest additions to our product lineup.", "We have exciting products on the horizon. To discover our upcoming releases, check our 'Upcoming Products' page for updates."]
    },
    {
      "tag": "account_management",
      "patterns": ["How do I manage my account?", "Account settings", "Profile updates"],
      "responses": ["Account management is straightforward. You can access your account settings and make profile updates on our website. If you need assistance with specific account tasks, please specify your request.", "Managing your account is easy. On our website, you can navigate to your account settings and update your profile information. Let me know if you need help with a particular task."]
    },
    {
      "tag": "business_orders",
      "patterns": ["I'm inquiring on behalf of my business", "Business orders", "Corporate purchases"],
      "responses": ["We offer solutions for business orders and corporate purchases. To discuss specific business needs, please share your contact information, and our business services team will reach out to you.", "Business orders and corporate purchases require tailored solutions. Kindly provide your contact details, and our business services team will assist you."]
    },
    {
      "tag": "subscription_cancellation",
      "patterns": ["How can I cancel my subscription?", "Canceling product subscription", "Subscription termination"],
      "responses": ["If you wish to cancel your subscription, you can do so by accessing your account settings on our website. To guide you through the subscription cancellation process, please provide the subscription details.", "Cancelling a subscription is simple. Share the subscription details, and I'll provide step-by-step instructions to terminate it."]
    },
    {
      "tag": "product_notifications",
      "patterns": ["Can I receive product notifications?", "Product alerts", "Notify me of product updates"],
      "responses": ["Yes, you can receive product notifications. To stay informed about product updates and releases, please subscribe to our product notification service on our website.", "Product notifications keep you updated. Subscribe to our product notification service to receive alerts about new releases."]
    },
    {
      "tag": "delivery_information",
      "patterns": ["Tell me about product delivery", "Delivery options", "Shipping details"],
      "responses": ["We provide various delivery options to suit your needs. For information about product delivery, including shipping methods and estimated delivery times, please visit our 'Delivery Information' page on our website.", "Getting your products to you is our priority. Explore delivery options and shipping details on our 'Delivery Information' page."]
    },
    {
      "tag": "order_tracking",
      "patterns": ["How can I track my order?", "Track order status", "Order shipment tracking"],
      "responses": ["To track your order, access your account on our website and go to the 'Order Tracking' section. You'll find real-time order status updates and shipment tracking details.", "Order tracking is convenient. Log in to your account, visit the 'Order Tracking' section, and follow your order's progress."]
    },
    {
      "tag": "discounts_and_promotions",
      "patterns": ["Are there any discounts or promotions?", "Current deals", "Promotional offers"],
      "responses": ["We often have discounts and promotions. To see our current deals and promotional offers, please visit the 'Discounts & Promotions' page on our website.", "Saving money is always a great idea. Check out our 'Discounts & Promotions' page for the latest deals and special offers."]
    },
    {
      "tag": "customer_reviews",
      "patterns": ["Can I read customer reviews?", "Product reviews", "User feedback"],
      "responses": ["Certainly, you can read customer reviews. Click on the 'Customer Reviews' section on the product page you're interested in. You'll find honest feedback from other customers who've purchased the product.", "Customer reviews provide insights. Visit the 'Customer Reviews' section on product pages to read experiences shared by our customers."]
    },
    {
      "tag": "product_availability",
      "patterns": ["Is the product in stock?", "Product availability", "Stock status"],
      "responses": ["To check the product's availability and stock status, please visit the product page. We regularly update stock information, so you can be confident when making a purchase.", "We strive to maintain accurate stock information. Visit the product page to check the product's availability and stock status."]
    },
    {
      "tag": "payment_methods",
      "patterns": ["What payment methods are accepted?", "Payment options", "Accepted payments"],
      "responses": ["We accept a variety of payment methods, including credit cards, debit cards, and digital wallets. You can view the full list of accepted payment methods during the checkout process on our website.", "Convenient payment options are available. During checkout, you'll see the list of accepted payment methods, including credit cards and digital wallets."]
    },
    {
      "tag": "product_warranty",
      "patterns": ["Tell me about product warranties", "Warranty information", "Product guarantee"],
      "responses": ["Our products come with warranties for your peace of mind. To learn about product warranties and guarantee details, please visit the 'Product Warranty' section on our website.", "Quality and satisfaction are important. Explore the 'Product Warranty' section to understand our product warranties and guarantees."]
    },
    {
      "tag": "bulk_purchases",
      "patterns": ["Do you offer discounts for bulk purchases?", "Bulk order discounts", "Large quantity orders"],
      "responses": ["Yes, we offer discounts for bulk purchases. To inquire about discounts for large quantity orders, please contact our sales department by providing your contact information, and they'll assist you.", "If you're making large quantity orders, we provide special discounts. Please share your contact details, and our sales team will get in touch with you."]
    },
    {
      "tag": "product_compatibility",
      "patterns": ["Is this product compatible with other products?", "Compatibility information", "Product and accessory compatibility"],
      "responses": ["Product compatibility is important. To find information about product compatibility with other products or accessories, visit the 'Compatibility' section on the product page.", "To ensure product compatibility with other items, consult the 'Compatibility' section on the product page for compatibility information."]
    },
    {
      "tag": "satisfaction_feedback",
      "patterns": ["I want to provide feedback about my purchase", "Customer satisfaction feedback", "Share my experience"],
      "responses": ["We value your feedback. To share your experience or provide feedback about your purchase, please visit the 'Customer Feedback' section on our website. Your feedback helps us improve our products and services.", "Your feedback matters to us. Head to the 'Customer Feedback' section on our website to share your thoughts and experiences."]
    },
    {
      "tag": "return_policy",
      "patterns": ["What is your return policy?", "Return process", "Product returns"],
      "responses": ["Our return policy ensures customer satisfaction. You can find detailed information about our return process, including eligibility criteria and steps to initiate a return, on the 'Return Policy' page of our website.", "Customer satisfaction is our priority. Learn about our return policy, including the return process, on the 'Return Policy' page."]
    },
    {
      "tag": "product_comparison",
      "patterns": ["How can I compare products?", "Product comparison tool", "Find the right product"],
      "responses": ["We offer a product comparison tool for your convenience. Visit the 'Product Comparison' section on our website to compare multiple products side by side and make informed decisions.", "Choosing the right product is easy with our product comparison tool. Explore the 'Product Comparison' section to compare features and specifications."]
    },
    {
      "tag": "gift_options",
      "patterns": ["Do you offer gift options?", "Gift wrapping service", "Gift cards"],
      "responses": ["Yes, we provide gift options to make your shopping experience special. You can opt for gift wrapping during the checkout process or purchase gift cards for your loved ones on our website.", "Celebrate special occasions with our gift options. Choose gift wrapping during checkout or explore our gift cards for gifting."]
    },
    {
      "tag": "product_recommendations",
      "patterns": ["Can you recommend a product for me?", "Product suggestions", "Find the right product"],
      "responses": ["Of course, we can help you find the right product. Please provide us with some details about your preferences, such as the type of product and your budget, and we'll recommend suitable options from our selection.", "We're here to assist you in finding the perfect product. Share your preferences, and we'll offer personalized recommendations."]
    },
    {
      "tag": "product_customization",
      "patterns": ["Can I customize a product?", "Product personalization", "Customized options"],
      "responses": ["Yes, we offer product customization for certain items. To explore personalized options and inquire about customization availability, please visit the 'Product Customization' section on our website or contact our sales team.", "Add a personal touch to your purchase. Check our 'Product Customization' section for customized product options or contact our sales team for assistance."]
    },
    {
      "tag": "shipping_costs",
      "patterns": ["How much is the shipping cost?", "Shipping fees", "Delivery charges"],
      "responses": ["Shipping costs may vary depending on your location and the chosen shipping method. You can view the shipping charges during the checkout process on our website before finalizing your order.", "Transparency is important. Get information about shipping costs during the checkout process on our website and review delivery charges before placing your order."]
    },
    {
      "tag": "technical_support",
      "patterns": ["I need technical support", "Product assistance", "Tech help"],
      "responses": ["For technical support and product assistance, please visit our 'Technical Support' page or contact our dedicated technical support team. They will provide guidance and solutions for your technical inquiries.", "If you need technical assistance, our technical support team is here to help. Find guidance and solutions on our 'Technical Support' page or contact our team directly."]
    },
    {
      "tag": "lost_order",
      "patterns": ["I haven't received my order", "Lost shipment", "Order not delivered"],
      "responses": ["If you haven't received your order, we apologize for the inconvenience. Please contact our customer service with your order details, and we'll investigate the issue and provide a resolution.", "We understand the concern of a lost order. Reach out to our customer service with your order information, and we'll investigate and assist you promptly."]
    },
    {
      "tag": "loyalty_program",
      "patterns": ["Do you have a loyalty program?", "Customer rewards", "Membership benefits"],
      "responses": ["Yes, we offer a loyalty program. To learn about customer rewards, membership benefits, and how to join, please visit the 'Loyalty Program' section on our website. It's our way of showing appreciation for your support.", "Our loyalty program rewards your loyalty. Discover membership benefits and join our loyalty program by visiting the 'Loyalty Program' section."]
    },
    {
      "tag": "online_support",
      "patterns": ["How can I get online support?", "Online chat assistance", "Live chat help"],
      "responses": ["Online support is just a click away. You can get assistance through our live chat feature on the website. Simply click the 'Live Chat' button to connect with our support team in real time.", "Need quick online support? Click the 'Live Chat' button on our website to connect with our support team for immediate assistance."]
    }
  ]
}
